renesas/cpk_examples/cpknet_ra8t2/adc_singlescan_cpknet_ra8t2_ep/e2studio_llvm/src/hal_entry.c
#include "hal_data.h"
#include "console.h"
#include "coremark/coremark.h"
#include "perf_counter/perf_counter.h"
#include "perf_adc.h"
#if (1 == BSP_MULTICORE_PROJECT) && BSP_TZ_SECURE_BUILD
bsp_ipc_semaphore_handle_t g_core_start_semaphore =
{
    .semaphore_num = 0
};
#endif

/*******************************************************************************************************************//**
 * main() is generated by the RA Configuration editor and is used to generate threads if an RTOS is used.  This function
 * is called by main() when no RTOS is used.
 **********************************************************************************************************************/
void hal_entry(void)
{
    /* TODO: add your own code here */
    fsp_err_t err = FSP_SUCCESS;
    CONSOLE_Init();
    perfc_init(false);
    if (FSP_SUCCESS != err)
    {
        printf(0, "\r\n Timer Initialization Failed, Test Exited!\r\n");
    }
    err = adc_init();
    R_IOPORT_PinWrite(g_ioport.p_ctrl, USER_LED, BSP_IO_LEVEL_HIGH);

    if(FSP_SUCCESS != err)
    {
        printf("ADC initialize failed\r\n");
    }
    /* 等待任意输入，如果不需要，这个 while 循环可以删除 */
    printf("Input any character to start adc test\r\n");
    while (1) {
        R_BSP_SoftwareDelay(2, BSP_DELAY_UNITS_SECONDS);
        if (CONSOLE_HasData()) {
            break;
        }
        else {
            printf("Input any character to start adc test\r\n");
        }
    }
    printf("ADC test running, please wait...\r\n");
    //int32_t time_start = R_GPT0->GTCNT;
    //int64_t time_start = get_system_us();
    __cycleof__("ADC") {
        /* 要评估其它代码的性能，注释下面这条语句，然后在后面添加要评估的代码 */
        adc_SingleScan_test();
        //coremark_main();
    };
    //int32_t time_end = R_GPT0->GTCNT;
    err = adc_read_data();
    if(FSP_SUCCESS != err)
    {
            printf("ADC READ failed\r\n");
    }
    err =  adc_scan_stop();
    if(FSP_SUCCESS != err)
    {
        printf("ADC STOP failed\r\n");
    }
    //printf("Total time: %d us\r\n", time_end - time_start);
    while (1) {
        R_IOPORT_PinWrite(g_ioport.p_ctrl, USER_LED, BSP_IO_LEVEL_HIGH);
        R_BSP_SoftwareDelay(500, BSP_DELAY_UNITS_MILLISECONDS);
        R_IOPORT_PinWrite(g_ioport.p_ctrl, USER_LED, BSP_IO_LEVEL_LOW);
        R_BSP_SoftwareDelay(500, BSP_DELAY_UNITS_MILLISECONDS);
        //adc_read_data();
    }
    /* Wake up 2nd core if this is first core and we are inside a multicore project. */
#if (0 == _RA_CORE) && (1 == BSP_MULTICORE_PROJECT) && !BSP_TZ_NONSECURE_BUILD

#if BSP_TZ_SECURE_BUILD
    /* Take semaphore so 2nd core can clear it */
    R_BSP_IpcSemaphoreTake(&g_core_start_semaphore);
#endif

    R_BSP_SecondaryCoreStart();

#if BSP_TZ_SECURE_BUILD
    /* Wait for 2nd core to start and clear semaphore */
    while(FSP_ERR_IN_USE == R_BSP_IpcSemaphoreTake(&g_core_start_semaphore))
    {
        ;
    }
#endif
#endif

#if (1 == _RA_CORE) && (1 == BSP_MULTICORE_PROJECT) && BSP_TZ_SECURE_BUILD
    /* Signal to 1st core that 2nd core has started */
    R_BSP_IpcSemaphoreGive(&g_core_start_semaphore);
#endif

#if BSP_TZ_SECURE_BUILD
    /* Enter non-secure code */
    R_BSP_NonSecureEnter();
#endif
}

#if BSP_TZ_SECURE_BUILD

FSP_CPP_HEADER
BSP_CMSE_NONSECURE_ENTRY void template_nonsecure_callable ();

/* Trustzone Secure Projects require at least one nonsecure callable function in order to build (Remove this if it is not required to build). */
BSP_CMSE_NONSECURE_ENTRY void template_nonsecure_callable ()
{

}
FSP_CPP_FOOTER

#endif
